#################################### General ################################################
NONAME-NO_ACCESS = У вас відсутній доступ, попросіть у адміністраторів

REGISTER-SUCCESS = Зареєстровано успішно
REGISTER-FAIL = Помилка реєстрації

MENU = Меню
BACK = Назад

################################### NONAME ###############################################
JOIN_KEY-NOT_EXIST = Ключа не існує!
JOIN_KEY-ACTIVATED_BEFORE = Ключ був активований раніше до вас!
JOIN_KEY-FAIL_UPDATE = Якась помилка. Ключ команди не встановлено
JOIN_KEY-SUCCESS_UPDATE = Ключ команди встановлено успішно!


#################################### CLIENT #################################################
CLIENT-ACCOUNTS = Акаунти
